# Product
## data management, stats, analytics
### hypothesis testing, regression theory, central limit theorem, bayes theorem, conditional and joint probabilities and basic distributions (exponential, geometric, binomial). estimators (consistency, bias, efficiency)

### 1- Company wants to update homepage to increas CTR (click through rate). Perfomed 50 hypothesis tests of 50 new features and set max type I erroe rate to 5%. Found there are 4 features with P-value < 0.05. However found immediate decrese in CTR when new features were applied. What might be most likely reason for the decrease?

Answer: While shipping a feature to users, it is imperative to validate assumptions about design and features in order to understand their impact in the real world.
types: A/B Testing - Multivariate Testing - Before/After Testing - Time-based On/Off Testing
After the right test is chosen and designed, and the success criteria and metrics are identified, the results must be analyzed. 
Null hypothesis: The null hypothesis is typically denoted as . The null hypothesis states the "status quo". This hypothesis is assumed to be true until there is evidence to suggest otherwise.
Alternative hypothesis: The alternative hypothesis is typically denoted as  or . This is the statement that one wants to conclude. It is also called the research hypothesis.
This uncertainty can be of 2 types: Type I error (falsely rejecting a null hypothesis) and type II error (falsely accepting a null hypothesis).
stats in here: 
1- Sampling (not have a bias): In order to ensure no bias in sampling, one can observe the mean and variance for the success metric before the change is introduced.
2- Significance and P-Value: In statistics, the p-value depicts the probability that, assuming the null hypothesis is correct, you might still observe results that are at least as extreme as the results of your hypothesis test. The smaller the p-value, the more likely the alternative hypothesis is correct, and the greater the significance of your results.
#### Testing multiple hypotheses increases the risk of drawing a false-positive conclusion or the Type I error rate (a Type I error is another name for incorrectly rejecting the null hypothesis).
What is the Multiple Testing Problem?
If you run a hypothesis test, there’s a small chance (usually about 5%) that you’ll get a bogus significant result. but if 20 different researchers evaluate 20 different aspects of a policy intervention, even if the intervention did nothing, we should expect one statistically significant result and 19 statistically insignificant results. When you run multiple tests, the p-values have to be adjusted for how many hypothesis tests you are running.

#### What is composite key and example?
A primary key having two or more attributes is called composite key. It is a combination of two or more columns. An example can be − Here our composite key is OrderID and ProductID − {OrderID, ProductID}
#### A “One to one” relationship between two tables means that a row in one table can only relate to one row in the table on the other side of their relationship and vice versa. For example, there might be a one-to-one relationship between employees and the cars they drive.

# Travel agency case
Users can request to book a package creating a "lead". Then suppliers confirm or not their pricing and availability and users have have 48 hours to pay. Acency earns a percentage of every package sold.

In [42]:
import pandas as pd
import numpy as np
leads = pd.read_csv("Leads_list.csv")
suppliers = pd.read_csv("Suppliers_fee_list.csv")

In [9]:
leads.head()

,id,first_name,received,administrator,guide_code,Country of Origin,Initial_guide_code,custom trip,trip_code,status,...,main_activity,skill_level,destination_country,people_count,cancellation_reason,source,base_price_local_currency,price_currency,exchange_rate,payment_method
0,21402,Peter,24/12/2018,NaN,97,Australia,360,NaN,127.0,1_cancelled,...,Mountaineering,intermediate,81.0,1,Changed plans,Organic,1950,EUR,1.000,NaN
1,21357,Lynne,22/12/2018,NaN,115,United Kingdom,115,NaN,558.0,1_cancelled,...,Heliskiing,advanced,74.0,1,Changed plans,Organic,1140,EUR,1.000,NaN
2,21344,chris,22/12/2018,NaN,212,United States,24,Yes,NaN,1_cancelled,...,Hiking,intermediate,10.0,2,Changed plans / Out of season,Organic,2300,USD,0.879,NaN
3,21209,Yubo,18/12/2018,NaN,1,Mexico,1,NaN,56.0,1_cancelled,...,Mountaineering,intermediate,142.0,1,Changed plans,Referral,400,USD,0.879,NaN
4,21207,Jaime,18/12/2018,NaN,165,Spain,165,NaN,45.0,1_cancelled,...,Heliskiing,advanced,58.0,2,Changed plans,Paid,4380,EUR,1.000,NaN

In [10]:
suppliers.head()

   guide_code month_received  guide_fee
0           1    November-18         10
1           2    November-18         10
2           3    November-18         10
3           4    November-18         10
4           5    November-18         10

In [33]:
leads.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 919 entries, 0 to 918
Data columns (total 26 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   id                            919 non-null    int64
 1   first_name                    743 non-null    object
 2   received                      919 non-null    object
 3   administrator                 0 non-null      float64
 4   guide_code                    919 non-null    int64
 5   Country of Origin             815 non-null    object
 6   Initial_guide_code            919 non-null    int64
 7   custom trip                   190 non-null    object
 8   trip_code                     756 non-null    float64
 9   status                        919 non-null    object
 10  departure_date                85 non-null     object
 11  duration                      853 non-null    float64
 12  guide_confirmed_date          919 non-null    object
 13  guide_availability confirmed  919 non-null    object
 14  availability                  689 non-null    object
 15  guide_recommendation          919 non-null    object
 16  main_activity                 894 non-null    object
 17  skill_level                   610 non-null    object
 18  destination_country           865 non-null    float64
 19  people_count                  919 non-null    object
 20  cancellation_reason           834 non-null    object
 21  source                        919 non-null    object
 22  base_price_local_currency     919 non-null    object
 23  price_currency                919 non-null    object
 24  exchange_rate                 919 non-null    float64
 25  payment_method                85 non-null     object
dtypes: float64(5), int64(3), object(18)
memory usage: 186.8+ KB

In [34]:
leads.columns

# movies_df.rename(columns={
#         'Runtime (Minutes)': 'Runtime', 
#         'Revenue (Millions)': 'Revenue_millions'
#     }, inplace=True)

Index(['id', 'first_name', 'received', 'administrator', 'guide_code',
       'Country of Origin', 'Initial_guide_code', 'custom trip', 'trip_code',
       'status', 'departure_date', 'duration', 'guide_confirmed_date',
       'guide_availability confirmed', 'availability', 'guide_recommendation',
       'main_activity', 'skill_level', 'destination_country', 'people_count',
       'cancellation_reason', 'source', 'base_price_local_currency',
       'price_currency', 'exchange_rate', 'payment_method'],
      dtype='object')

In [ ]:
# Conditional Selection

Function Description
mean() Compute mean of groups
sum() Compute sum of group values
size() Compute group sizes
count() Compute count of group
std() Standard deviation of groups
var() Compute variance of groups
sem() Standard error of the mean of groups
describe() Generates descriptive statistics
first() Compute first of group values
last() Compute last of group values
nth() Take nth value, or a subset if n is a list
min() Compute min of group values
max() Compute max of group values

In [52]:
# Q1: How many suppliers accepted an increase in their Dec commission compare to Nov 2018?

changes = suppliers.groupby('guide_code').std()
changes.guide_fee.value_counts()

0.000000    343
3.535534      8
7.071068      2
Name: guide_fee, dtype: int64

In [56]:
# Q2: How many sales are with an alternative guide or agency?
# i think it wants difference between guide_code and Inital_guide_code
alt_guide = leads[leads.guide_code != leads.Initial_guide_code]
alt_guide['id'].nunique()

345


Q3: The data team is creating an algorithm to detect leads with high probability of converting to sales. Which of the following is not a reasonable factor in their model? 1)Country of origin 2)Price of package 3)Anticipation to travel 4)Lead ID 5)Number of previous purchases
Q4: which of the following would not provide useful insights about customers? 1)Average people count 2)Difference between recieved and departure dates 3)average country code 4)median trip duration 5)Top 10 countries of origin
Q5: team wants to remove suppliers that get lots of leads but have to replaced frequently. Which guides was replaced by another the most times?
Q6: How is the conversion rate from lead to sold of custom trips compared to standard trips?
Q7: Considering the sales, which of the destination countries has the highest average price per day
of trip?

In [12]:
# Summaries
suppliers.describe()

       guide_code   guide_fee
count  706.000000  706.000000
mean   177.000000   10.339943
std    101.974159    1.515131
min      1.000000   10.000000
25%     89.000000   10.000000
50%    177.000000   10.000000
75%    265.000000   10.000000
max    353.000000   20.000000

In [13]:
leads.cancellation_reason.unique()

array(['Changed plans', 'Changed plans / Out of season',
       'Too last minute request / Out of season',
       'Weather conditions / Too early to book / Time response from guide',
       'Pending - Form not filled', nan,
       'No available guide / Time response from guide',
       'Client do not Understand the process', 'Contacted guide directly',
       'No available guide', 'Time response from guide', 'No open group',
       'Not looking for a guide', 'Other', 'Out of season', 'Postponed',
       'Too early to book', 'Too last minute request',
       'Weather conditions', 'Went to competition'], dtype=object)

In [14]:
# To see a list of unique values and how often they occur in the dataset, we can use the value_counts() method:
leads.source.value_counts()

Organic         642
Unknown         135
Referral         69
Paid             45
web              18
Social Media      4
manual            3
Returning         2
Direct            1
Name: source, dtype: int64

## Maps
A map is a term, for a function that takes one set of values and "maps" them to another set of values.

In [17]:
# Grouping & Sorting
pd.set_option("display.max_rows", 7)
leads.groupby('duration').duration.count()

duration
1.0     266
2.0     120
3.0     142
       ...
29.0      1
30.0      2
35.0      1
Name: duration, Length: 26, dtype: int64

In [20]:
leads.groupby('duration').base_price_local_currency.min()

duration
1.0           0.05
2.0              0
3.0            100
           ...
29.0    to confirm
30.0          2000
35.0        3999.5
Name: base_price_local_currency, Length: 26, dtype: object

In [23]:
leads.groupby(['Country of Origin']).base_price_local_currency.agg([min, max,len])

                      min         max  len
Country of Origin
Argentina             300  to confirm    3
Aruba                1200        1200    1
Australia          100000  to confirm   44
...                   ...         ...  ...
United Kingdom        100  to confirm  103
United States           0  to confirm  232
Viet Nam             1950  to confirm    4

[73 rows x 3 columns]

In [38]:
agency = leads.groupby('guide_code')
agency.mean()

,id,administrator,Initial_guide_code,trip_code,duration,destination_country,exchange_rate
guide_code,,,,,,,
1,20720.65,NaN,128.75,232.235294,2.15,142.0,0.879
2,20493.00,NaN,2.00,424.000000,5.00,232.0,0.879
3,21037.00,NaN,3.00,1.000000,1.00,74.0,1.000
...,...,...,...,...,...,...,...
352,21237.50,NaN,192.00,164.000000,3.50,33.0,1.000
353,20467.00,NaN,353.00,585.000000,NaN,177.0,1.000
357,21046.00,NaN,357.00,504.000000,1.00,74.0,1.000

In [41]:
agency.sum().loc[2]

id                     20493.000
administrator              0.000
Initial_guide_code         2.000
trip_code                424.000
duration                   5.000
destination_country      232.000
exchange_rate              0.879
Name: 2, dtype: float64